org/topics/ebpf.org
:properties:
:id:       b757ab31-be42-47b4-b21c-44a0efbf595b
:end:
#+title: eBPF

- Kernel side
  - either in C or [[id:cdf2a03e-f080-4e6f-8636-7c0f582d91fc][Rust]]
- userland (more programming languages)
- applications loaded directly into the kernel
- more secure than kernel modules since there is a verifier which does basic checks against the eBPF bytecode
- also Docker uses eBPF technologies under the hood

* Resources
- 2024-06-18 ◦ [[https://sazak.io/articles/an-applied-introduction-to-ebpf-with-go-2024-06-06][An Applied Introduction to eBPF with Go — Ozan Sazak]]
- 2023-09-06 ◦ [[https://sysdig.com/blog/ebpf-offensive-capabilities/][eBPF Offensive Capabilities - Get Ready for Next-gen Malware – Sysdig]]
- 2022-09-13 ◦ [[https://changelog.com/news/the-power-of-ebpf-pj2V][The power of eBPF |> Changelog]]
- 2022-09-13 ◦ [[https://ebpf.io/][eBPF - Introduction, Tutorials & Community Resources]]
