content/topics/ebpf.md
+++
title = "eBPF"
author = ["Victor Dorneanu"]
draft = false
+++

-   Kernel side
    -   either in C or [Rust](rust.md)
-   userland (more programming languages)
-   applications loaded directly into the kernel
-   more secure than kernel modules since there is a verifier which does basic checks against the eBPF bytecode
-   also Docker uses eBPF technologies under the hood


## Resources {#resources}

-   2024-06-18 ◦ [An Applied Introduction to eBPF with Go — Ozan Sazak](https://sazak.io/articles/an-applied-introduction-to-ebpf-with-go-2024-06-06)
-   2023-09-06 ◦ [eBPF Offensive Capabilities - Get Ready for Next-gen Malware – Sysdig](https://sysdig.com/blog/ebpf-offensive-capabilities/)
-   2022-09-13 ◦ [The power of eBPF |&gt; Changelog](https://changelog.com/news/the-power-of-ebpf-pj2V)
-   2022-09-13 ◦ [eBPF - Introduction, Tutorials &amp; Community Resources](https://ebpf.io/)
